<?php
/**
 *  Малко приложение, което приема команди
 *  от стандартния вход (конзолата) за:
 *  - регистрация;
 *  - логин;
 *  - създаване на въпрос във форума от
 *    текущо логнат потребител;
 *  - създаване на отговори на въпроси;
 *  - коментари на отговори;
 */

/**
 *  Потребтели
 *    - Пореден номер;
 *    - Име (тип string);
 *    - Парола (тип string);
 *    - ЗададениВъпроси (тип Въпрос масив- Въпрос []);
 *    - СъздадениОтговори (тип Отговор масив - Отговор []);
 *    - КоментариНаОтговори (тип Отговор масив - Отговор ]);
 *
 *  Въпроси
 *    - Пореден номер;
 *    - Заглавие (тип string);
 *    - Съдържание (тип string);
 *    - Автор (тип Потребител);
 *    - Отговори (тип Отговор масив - Отговор[]);
 *
 *  Отгивири
 *    - Пореден номер;
 *    - Съдържание (тип string);
 *    - ВъпросиНаКоитоЕОтговорено (тип Въпрос);
 *    - ОтговорНаКойтоЕКоментирано(тип Отговор);
 *    - Коментари (тип Отговор масив - Отговор []):
 */

 /**
 *
 *   register {username} {password}
 *   login {username} {password}
 *   ask {title} {password}
 *   answer {question} {body}
 *   comment {answerId} {body}
 */

require_once 'User/User.php';
require_once 'Content/Question.php';
require_once 'Content/Answer.php';
require_once 'Forum.php';
$forum = new Forum();
$forum->start();